package com.app.hzDict;

public class nameTogether {  
	  
    String[][] arrayaddresutlt = {  
        {"11",  "他对你献真情"},  
        {"12",  "他已有心上人"},  
        {"13",  "此情不渝"},  
        {"14",  "他时常暗中注意你"},  
        {"15",  "他有企图要小心"},  
        {"16",  "两人有默契"},  
        {"17",  "他非常关心你"},  
        {"18",  "你和他只能做朋友"},  
        {"19",  "兴趣不合"},  
        {"20",  "他会爱你"},  
        {"21",  "他非常在乎你"},  
        {"22",  "女方主动"},  
        {"23",  "要长期交往"},  
        {"24",  "也有人暗中注意你"},  
        {"25",  "女方单恋"},  
        {"26",  "不能长相厮守"},  
        {"27",  "他会喜欢你"},  
        {"28",  "要长期交往"},  
        {"29",  "他早就爱上你"},  
        {"30",  "他会抛弃你"},  
        {"31",  "要互相沟通"},  
        {"32",  "兴趣不合"},  
        {"33",  "他非常讨厌你"},  
        {"34",  "两情相悦"},  
        {"35",  "男生主动"},  
        {"36",  "此情不渝"},  
        {"37",  "他有企图要小心"},  
        {"38",  "他非常在乎你"},  
        {"39",  "他会爱你"},  
        {"40",  "女方单恋"},  
        {"41",  "第三者介入"},  
        {"42",  "他已有心上人"},  
        {"43",  "早点分手比较好"},  
        {"44",  "不能长相厮守"},  
        {"45",  "两情相悦"},  
        {"46",  "他对你献真情"},  
        {"47",  "他有一堆女朋友"},  
        {"48",  "他时常暗中注意你"},  
        {"49",  "此情不渝"},  
        {"50",  "他会喜欢你"},  
        {"51",  "要长期交往"},  
        {"52",  "他早就爱上你"},  
        {"53",  "他会抛弃你"},  
        {"54",  "要互相沟通"},  
        {"55",  "他已有心上人"},  
        {"56",  "两人有默契"},  
        {"57",  "他非常关心你"},  
        {"58",  "兴趣不合"},  
        {"59",  "第三者介入"},  
        {"60",  "早点分手比较好"},  
        {"61",  "两人有默契"},  
        {"62",  "你和他只能做朋友"},  
        {"63",  "男生主动"},  
        {"64",  "他非常讨厌你"},  
        {"65",  "两情相悦"},  
        {"66",  "他有一堆女朋友"},  
        {"67",  "他会爱你"},  
        {"68",  "要长期交往"},  
        {"69",  "此情不渝"},  
        {"70",  "他有一堆女朋友"},  
        {"71",  "他时常暗中注意你"},  
        {"72",  "他有企图要小心"},  
        {"73",  "他对你献真情"},  
        {"74",  "他已有心上人"},  
        {"75",  "他非常在乎你"},  
        {"76",  "女方主动"},  
        {"77",  "也有人暗中注意你"},  
        {"78",  "女方单恋"},  
        {"79",  "要长期交往"},  
        {"80",  "不能长相厮守"},  
        {"81",  "他会喜欢你"},  
        {"82",  "他早就爱上你"},  
        {"83",  "他会抛弃你"},  
        {"84",  "要互相沟通"},  
        {"85",  "两人有默契"},  
        {"86",  "他非常关心你"},  
        {"87",  "你和他只能做朋友"},  
        {"88",  "兴趣不合"},  
        {"89",  "男生主动"},  
        {"90",  "第三者介入"}};  
    String[][] arraysubtractresutlt = {  
        {"0", "天生一对，佳偶天成", "你们是如此的匹配，如此和谐，往往是你刚想说“可惜”他已经开始叹惜。你们性格相合，有共同的爱好，品味一致。就是这么默契，令人们羡慕得不得了。没办法，谁叫你们连姓名的笔画也一样呢。"},  
        {"1", "一见钟情，两情相悦", "你们在看到对方的第一眼就深深地被吸引，并立刻爱上对方，接着就是干柴烈火般的热。海誓山盟的爱情宣言是你们奉行的金科玉律。她崇拜他，同样她也令他着迷，他们就像磁石与铁一样相互吸引。"},  
        {"2", "执子之手，与子携老", "你们是众人眼中的神仙眷侣，站在一起怎么看怎么般配，很有传说中的夫妻相。你们之间或许没有惊天地泣鬼神的爱情神话，或许没有刻骨铭心的激情，但是你的之间的温情和默契却能让你们的心越走越近，一起慢慢变老。"},  
        {"3", "欢喜冤家，分分合合", "你们前世是冤家，今生做情侣，所以就难免有一些不和谐的音符出现来折磨你们的爱情。你们的感情大起大落，分分合合，不过你们最终会修成正果，恩爱到老的。"},  
        {"4", "有缘无分，两两相忘", "你们的感情一般是从学生时代开始的，那青涩的恋爱留给你们酸酸甜甜的味道让你们用一生去怀念彼此，但是你们的爱情却注定了没有结果，你们会试着遗忘对方，开始自己新的生活，但心中那最温柔的角落一直被初恋占据。"},  
        {"5", "风雨之后，亮丽彩虹", "你们都是性情中人，你们都受过感情的伤，你们都一样脆弱而敏感同。同样的经历，同样的伤痛，让你更容易靠近。你们的感情在相互疗伤中一点一点加深，你们的心痊愈了，你们的爱情也圆满了。"},  
        {"6", "日久生情，顺理成章", "你们很可能是在一起工作的同事，你们发展的是办公室爱情。朝九晚五的生活使你们互相产生好感，上下班路上的闲谈增进你们相互了解。你们的手牵在一起是顺理成章的事，", "在办公室里偷看一眼心上人也是你们最大的乐趣。"},  
        {"7", "知心朋友，心灵相通", "你们可以无话不谈，你们可以心有灵犀，但是你们却很难成为情侣。因为你们太熟悉彼此，太了解对方了，所以很难擦出火花。其实你们不用遗憾，人生得一知己足矣，就这样一直做朋友也很不错。"},  
        {"8", "青梅竹马，两小无猜", "你们的父母就很好的朋友，你们从穿开裆裤时就在一起。一起进幼儿园，一起上小学，一起过家家，一起闯祸后对家长撒谎。你们是长辈默认的娃娃亲，你们是邻居眼中的金童玉女，走到一起是天经地义的事。"},  
        {"9", "你喜欢他（她），他（她）爱别人", "在爱情的舞会上，你来晚了一步，你的心上人已经有了自己的NO.1，两人亲密无间，你已无缝插针。因此注定了你这段感情要深埋在心里，注定你是暗恋了小倒霉蛋。所以赶快清理一下心绪，去属于自己的爱情里做主角吧。"},  
        {"10", "浓情蜜意，情手难牵", "你们真的很合适，总能从对方的一个眼神洞悉心上人心中的一切。但是你们却走不到一起，并不是你们的原因，而是其他的因素，所以你们这段无疾而终的恋情令所有知情者扼腕。"},  
        {"11", "牛郎织女，聚少离多", "你们的爱情基础非常深厚，牢不可破，然而却因为求学或工作的原因，使得你们分隔两地，聚少离多。也许是因为相聚短暂而益显珍贵，而e信来往，电话传情给你们平添一份情调。"},  
        {"12", "相约黄昏，共赏夕阳", "你们或许因为年少轻狂，或许月老作弄，你们错过了年轻时激扬的热情。当你们的缘分到来的时候，你们已经经历了大半辈子的沧桑。好不容易结合的你们会更加珍惜、享受这迟来的爱。"},  
        {"13", "同床异梦，貌合神离", "在外人的眼中你们或许是一对模范夫妻，只有你自己心里明白根本不是那么一回事。你们根本就不了解对方，也不想去了解，各自有各自的圈子，交集很少。长痛不如短痛，还是选择放手吧。"},  
        {"14", "缘分天定，破镜重圆", "你们真是一对打不散的鸳鸯，情投意合，相互吸引。但是或话由于你们都太花心，都想有更多的选择，所以你们的罗曼史都很丰富。但是经历过后都会回头看到彼此，做出最正确的选择。"},  
        {"15", "水深火热，水火相容", "谁水火不相容的，你们就相处得不错。你们一个似水，平和，内殓。一个如火，热情，洒脱。两个性情迥异的人一样可以找到共同点，一样可以谱写爱曲。"},  
        {"16", "一本好书，只看一半", "你们都是很有内秀的人，也都能看穿人的内心。你们的感情甜美却不持久，当对方不能吸引你时，你会决然地放手。他（她）就像一本小说，你打开了，却没能读完。"},  
        {"17", "丑小鸭，白天鹅", "你们的差距很大，你们的结合完全打破了门当户对的传说。但是不管别人怎么看，你们就是这么恩爱。白天鹅怎么会爱上丑小鸭，只有他们自己清楚。"},  
        {"18", "单恋一枝花", "你的爱情也是从暗恋开始的，不过你会让他（她）上你。或许很曲折，会受伤，但你一直执着。朋友劝你天涯处处有芳草，你却单恋一枝花。"},  
        {"19", "悠悠岁月，爱情长跑", "你们爱情的战线拉得很长，或许三五年，或许十几年。但是结果是令人满意的，爱与被爱的人最后都会死心塌地。"},  
        {"20", "顺其自然，水到渠成", "如果问你们是谁先追的谁，是谁主动，你们回答不出来，因为你们的爱情在不知不觉中就来了，你们只不过是顺其自然地携起手。"},  
        {"22", "爱是永恒，平淡是真", "你们可能是经人介绍的，你们可能没有经过热就结婚。但是你们感情却很真实，与其你们的爱情平淡，不如说你们是大爱无声"},  
        {"22", "一眼万年，相思连连　", "你们可能是被现实分开的情侣，你们可能是在有归宿后相见。你们相爱，却不能在一起，只能遥远地思念。"}  
    };
    
    String[] bjx = {"赵","钱","孙","李","周","吴","郑","王","冯","陈","褚","卫","蒋","沈","韩","杨","朱","秦","尤","许",
    		  "何","吕","施","张","孔","曹","严","华","金","魏","陶","姜","戚","谢","邹","喻","柏","水","窦","章","云","苏","潘","葛","奚","范","彭","郎",
    		  "鲁","韦","昌","马","苗","凤","花","方","俞","任","袁","柳","酆","鲍","史","唐","费","廉","岑","薛","雷","贺","倪","汤","滕","殷",
    		  "罗","毕","郝","邬","安","常","乐","于","时","傅","皮","卞","齐","康","伍","余","元","卜","顾","孟","平","黄","和",
    		  "穆","萧","尹","姚","邵","湛","汪","祁","毛","禹","狄","米","贝","明","臧","计","伏","成","戴","谈","宋","茅","庞","熊","纪","舒",
    		  "屈","项","祝","董","梁","杜","阮","蓝","闵","席","季","麻","强","贾","路","娄","危","江","童","颜","郭","梅","盛","林","刁","钟",
    		  "徐","邱","骆","高","夏","蔡","田","樊","胡","凌","霍","虞","万","支","柯","昝","管","卢","莫","经","房","裘","缪","干","解","应",
    		  "宗","丁","宣","贲","邓","郁","单","杭","洪","包","诸","左","石","崔","吉","钮","龚","程","嵇","邢","滑","裴","陆","荣","翁","荀",
    		  "羊","于","惠","甄","曲","家","封","芮","羿","储","靳","汲","邴","糜","松","井","段","富","巫","乌","焦","巴","弓","牧","隗","山",
    		  "谷","车","侯","宓","蓬","全","郗","班","仰","秋","仲","伊","宫","宁","仇","栾","暴","甘","钭","厉","戎","祖","武","符","刘","景",
    		  "詹","束","龙","叶","幸","司","韶","郜","黎","蓟","溥","印","宿","白","怀","蒲","邰","从","鄂","索","咸","籍","赖","卓","蔺","屠",
    		  "蒙","池","乔","阴","郁","胥","能","苍","双","闻","莘","党","翟","谭","贡","劳","逄","姬","申","扶","堵","冉","宰","郦","雍","却",
    		  "璩","桑","桂","濮","牛","寿","通","边","扈","燕","冀","浦","尚","农","温","别","庄","晏","柴","瞿","阎","充","慕","连","茹","习",
    		  "宦","艾","鱼","容","向","古","易","慎","戈","廖","庾","终","暨","居","衡","步","都","耿","满","弘","匡","国","文","寇","广","禄",
    		  "阙","东","欧","殳","沃","利","蔚","越","夔","隆","师","巩","厍","聂","晁","勾","敖","融","冷","訾","辛","阚","那","简","饶","空",
    		  "曾","毋","沙","乜","养","鞠","须","丰","巢","关","蒯","相","查","后","荆","红","游","郏","竺","权","逯","盖","益","桓","公","仉",
    		  "督","岳","帅","缑","亢","况","郈","有","琴","归","海","晋","楚","闫","法","汝","鄢","涂","钦","商","牟","佘","佴","伯","赏","墨",
    		  "哈","谯","篁","年","爱","阳","佟","言","福","南","火","铁","迟","漆","官","冼","真","展","繁","檀","祭","密","敬","揭","舜","楼",
    		  "疏","冒","浑","挚","胶","随","高","皋","原","种","练","弥","仓","眭","蹇","覃","阿","门","恽","来","綦","召","仪","风","介","巨",
    		  "木","京","狐","郇","虎","枚","抗","达","杞","苌","折","麦","庆","过","竹","端","鲜","皇","亓","老","是","秘","畅","邝","还","宾",
    		  "闾","辜","纵","侴","万俟","司马","上官","欧阳","夏侯","诸葛","闻人","东方","赫连","皇甫","羊舌","尉迟","公羊","澹台","公冶","宗正",
    		  "濮阳","淳于","单于","太叔","申屠","公孙","仲孙","轩辕","令狐","钟离","宇文","长孙","慕容","鲜于","闾丘","司徒","司空","兀官","司寇",
    		  "南门","呼延","子车","颛孙","端木","巫马","公西","漆雕","车正","壤驷","公良","拓跋","夹谷","宰父","谷梁","段干","百里","东郭","微生",
    		  "梁丘","左丘","东门","西门","南宫","第五","公仪","公乘","太史","仲长","叔孙","屈突","尔朱","东乡","相里","胡母","司城","张廖","雍门",
    		  "毋丘","贺兰","綦毋","屋庐","独孤","南郭","北宫","王孙"};
  
    public String getTestResult(String names) {
    	
    	String result = null;
    	String Addresult = null;
    	String Subresult = null;
    	String Aname = names.substring(0,names.indexOf("配"));
    	String Bname = names.substring(names.indexOf("配")+1,names.length());
    	char[] chars = names.toCharArray();
    	int Atotal = 0;
    	int Btotal = 0;
    	int hz = 0; //判读是否全是汉字的标识
    	for(int i = 0;i < chars.length;i++){
//    		System.out.println(names.charAt(i));
    		if(names.charAt(i) >= 0x0391 && names.charAt(i) <= 0xFFE5){
    			hz += 1;
    		}
    	}
    	
    	if(chars.length == hz && Aname.length()<=4 && Bname.length()<=4){
    		Atotal = getNameBH(Aname);
    		Btotal = getNameBH(Bname);
//    		System.out.println(Atotal+"   "+Btotal);
    		int addreuslt = Atotal + Btotal;  
            addreuslt = addreuslt - 11;//数组从11画开始  
            int subtractresutlt = Math.abs(Atotal - Btotal);  
            if (addreuslt < 0 || addreuslt > arrayaddresutlt.length) {
            	Addresult = "你们名字太强悍，无力吐槽";
            }else {
            	Addresult = pringst(arrayaddresutlt[addreuslt]);  
            }  
            if (subtractresutlt < 0 || subtractresutlt > arraysubtractresutlt.length) {  
                Subresult = "你们名字太强悍，无力吐槽";
            }else {  
                Subresult = pringst(arraysubtractresutlt[subtractresutlt]);  
            }
            
            result = "你们名字笔画之和是："+Addresult.substring(1,Addresult.indexOf(",",2))+"\r\n"+Addresult.substring(Addresult.indexOf(",",2)+1,Addresult.length())+"\r\n"
            	   + "你们名字笔画相减是："+Subresult.substring(1,Subresult.indexOf(",",2))+"\r\n"+Subresult.substring(Subresult.indexOf(",",2)+1,Subresult.length());
    	}else{
    		result = "你们名字太强悍，无力吐槽";
    	}
    	return result;
//    	System.out.println(Atotal+"   "+Btotal);
//    	System.out.println(chars.length+"   "+hz);
//    	System.out.println(Aname);
//    	System.out.println(Bname);
    }
    
    public int getNameBH(String name){
    	char[] chars = name.toCharArray();
    	int total = 0;
    	boolean dx = false;
    	boolean fx = false;
    	
//    	System.out.println(bjx.length);
		for(int i = 0;i < bjx.length;i++){
//			System.out.println(bjx[i]);
			if(name.length()>=2 && name.length()<=3 && name.substring(0,1).equals(bjx[i])){
				dx = true;
			}
			if(name.length()>=3 && name.substring(0,2).equals(bjx[i])){
				fx =true;
			}
		}
		
		if(dx || fx && name.length()<=4){
			for(int i = 0;i < chars.length;i++){
//				System.out.println(Achars[i]+" "+hanziDict.getBH(Achars[i]).length());
				total += hanziDict.getBH(chars[i]).length();
			}
//			System.out.println(Atotal);
		}
		return total;
    }
      
	public String pringst(String[] res) {  
	    StringBuffer result = new StringBuffer();
	    for (int i = 0; i < res.length; i++) {
	    	 result.append(",");
	        result.append(res[i]);
	    }  
	    result.append("\r\n");  
	    return result.toString();  
	}  
  
    public static void main(String[] args) {  
        nameTogether nt = new nameTogether();
        System.out.println(nt.getTestResult("拓跋靖配黄蓉"));
    }  
    
}  
